/**
 * 3.1
 *
 *  ООП - парадигма программирования, в которой программа состоит из объектов, взаимодействующими
 * друг с другом по средствам обмена сообщениями
 *
 *  Класс - общее описание, схема того как устроена сущность.
 *
 *  Объект - мыслимая или реальная сущность, обладающая характерным поведением
 * и отличительными признаками.
 *
 *  Абстракция - выделение главных сущностей и свойст реального мира, для представления их в программе
 *
 *  Инкапсуляция - объединение внутри класса данных и операций над ними, защита из от внешнего использования.
 *
 *  Наследование - создание нового класса на основе существующего.
 *
 *  Полиморфизм - возможность использования производного класса там, где разрешен экземпляр базавого (при этом
 * используются методы переопределенные в производном классе)
 *
 * 3.2
 *
 *  модификаторы protected и private не применимы для классов верхнего уровня (только для вложенных)
 *
 *
 */

public class OOPEamlple {
    public static void main(String[] args) {

    }

}


